node {
  name: "keras_learning_phase"
  op: "PlaceholderWithDefault"
  input: "keras_learning_phase/input"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "input_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "conv2d/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d/kernel"
}
node {
  name: "conv2d/Conv2D"
  op: "Conv2D"
  input: "input_1"
  input: "conv2d/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization/cond/switch_t"
  op: "Identity"
  input: "batch_normalization/cond/Switch:1"
}
node {
  name: "batch_normalization/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization/gamma"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization/beta"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/beta"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization/cond/ReadVariableOp"
  input: "batch_normalization/cond/ReadVariableOp_1"
  input: "batch_normalization/cond/Const"
  input: "batch_normalization/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d/Conv2D"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization/gamma"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization/beta"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/beta"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization/moving_mean"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization/moving_variance"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization/cond/ReadVariableOp_2"
  input: "batch_normalization/cond/ReadVariableOp_3"
  input: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d/Conv2D"
  input: "batch_normalization/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization/cond/Merge"
  op: "Merge"
  input: "batch_normalization/cond/FusedBatchNormV3_1"
  input: "batch_normalization/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "zero_padding2d/Pad"
  op: "Pad"
  input: "leaky_re_lu/LeakyRelu"
  input: "zero_padding2d/Pad/paddings"
}
node {
  name: "conv2d_1/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_1/kernel"
}
node {
  name: "conv2d_1/Conv2D"
  op: "Conv2D"
  input: "zero_padding2d/Pad"
  input: "conv2d_1/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_1/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_1/cond/Switch:1"
}
node {
  name: "batch_normalization_1/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_1/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_1/gamma"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_1/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_1/beta"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_1/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_1/cond/ReadVariableOp"
  input: "batch_normalization_1/cond/ReadVariableOp_1"
  input: "batch_normalization_1/cond/Const"
  input: "batch_normalization_1/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_1/Conv2D"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_1/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_1/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_1/gamma"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_1/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_1/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_1/beta"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_1/moving_mean"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_1/moving_variance"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_1/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_1/cond/ReadVariableOp_2"
  input: "batch_normalization_1/cond/ReadVariableOp_3"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_1/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_1/Conv2D"
  input: "batch_normalization_1/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_1/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_1/cond/Merge"
  op: "Merge"
  input: "batch_normalization_1/cond/FusedBatchNormV3_1"
  input: "batch_normalization_1/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_1/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_1/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "conv2d_2/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_2/kernel"
}
node {
  name: "conv2d_2/Conv2D"
  op: "Conv2D"
  input: "leaky_re_lu_1/LeakyRelu"
  input: "conv2d_2/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_2/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_2/cond/Switch:1"
}
node {
  name: "batch_normalization_2/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_2/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_2/gamma"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_2/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_2/beta"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_2/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_2/cond/ReadVariableOp"
  input: "batch_normalization_2/cond/ReadVariableOp_1"
  input: "batch_normalization_2/cond/Const"
  input: "batch_normalization_2/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_2/Conv2D"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_2/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_2/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_2/gamma"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_2/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_2/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_2/beta"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_2/moving_mean"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_2/moving_variance"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_2/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_2/cond/ReadVariableOp_2"
  input: "batch_normalization_2/cond/ReadVariableOp_3"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_2/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_2/Conv2D"
  input: "batch_normalization_2/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_2/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_2/cond/Merge"
  op: "Merge"
  input: "batch_normalization_2/cond/FusedBatchNormV3_1"
  input: "batch_normalization_2/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_2/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_2/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "conv2d_3/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_3/kernel"
}
node {
  name: "conv2d_3/Conv2D"
  op: "Conv2D"
  input: "leaky_re_lu_2/LeakyRelu"
  input: "conv2d_3/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_3/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_3/cond/Switch:1"
}
node {
  name: "batch_normalization_3/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_3/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_3/gamma"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_3/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_3/beta"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_3/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_3/cond/ReadVariableOp"
  input: "batch_normalization_3/cond/ReadVariableOp_1"
  input: "batch_normalization_3/cond/Const"
  input: "batch_normalization_3/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_3/Conv2D"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_3/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_3/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_3/gamma"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_3/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_3/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_3/beta"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_3/moving_mean"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_3/moving_variance"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_3/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_3/cond/ReadVariableOp_2"
  input: "batch_normalization_3/cond/ReadVariableOp_3"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_3/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_3/Conv2D"
  input: "batch_normalization_3/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_3/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_3/cond/Merge"
  op: "Merge"
  input: "batch_normalization_3/cond/FusedBatchNormV3_1"
  input: "batch_normalization_3/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_3/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_3/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "add/add"
  op: "AddV2"
  input: "leaky_re_lu_1/LeakyRelu"
  input: "leaky_re_lu_3/LeakyRelu"
}
node {
  name: "zero_padding2d_1/Pad"
  op: "Pad"
  input: "add/add"
  input: "zero_padding2d_1/Pad/paddings"
}
node {
  name: "conv2d_4/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_4/kernel"
}
node {
  name: "conv2d_4/Conv2D"
  op: "Conv2D"
  input: "zero_padding2d_1/Pad"
  input: "conv2d_4/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_4/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_4/cond/Switch:1"
}
node {
  name: "batch_normalization_4/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_4/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_4/gamma"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_4/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_4/beta"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_4/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_4/cond/ReadVariableOp"
  input: "batch_normalization_4/cond/ReadVariableOp_1"
  input: "batch_normalization_4/cond/Const"
  input: "batch_normalization_4/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_4/Conv2D"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_4/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_4/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_4/gamma"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_4/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_4/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_4/beta"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_4/moving_mean"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_4/moving_variance"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_4/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_4/cond/ReadVariableOp_2"
  input: "batch_normalization_4/cond/ReadVariableOp_3"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_4/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_4/Conv2D"
  input: "batch_normalization_4/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_4/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_4/cond/Merge"
  op: "Merge"
  input: "batch_normalization_4/cond/FusedBatchNormV3_1"
  input: "batch_normalization_4/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_4/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_4/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "conv2d_5/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_5/kernel"
}
node {
  name: "conv2d_5/Conv2D"
  op: "Conv2D"
  input: "leaky_re_lu_4/LeakyRelu"
  input: "conv2d_5/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_5/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_5/cond/Switch:1"
}
node {
  name: "batch_normalization_5/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_5/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_5/gamma"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_5/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_5/beta"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_5/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_5/cond/ReadVariableOp"
  input: "batch_normalization_5/cond/ReadVariableOp_1"
  input: "batch_normalization_5/cond/Const"
  input: "batch_normalization_5/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_5/Conv2D"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_5/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_5/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_5/gamma"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_5/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_5/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_5/beta"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_5/moving_mean"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_5/moving_variance"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_5/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_5/cond/ReadVariableOp_2"
  input: "batch_normalization_5/cond/ReadVariableOp_3"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_5/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_5/Conv2D"
  input: "batch_normalization_5/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_5/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_5/cond/Merge"
  op: "Merge"
  input: "batch_normalization_5/cond/FusedBatchNormV3_1"
  input: "batch_normalization_5/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_5/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_5/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "conv2d_6/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_6/kernel"
}
node {
  name: "conv2d_6/Conv2D"
  op: "Conv2D"
  input: "leaky_re_lu_5/LeakyRelu"
  input: "conv2d_6/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_6/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_6/cond/Switch:1"
}
node {
  name: "batch_normalization_6/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_6/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_6/gamma"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_6/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_6/beta"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_6/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_6/cond/ReadVariableOp"
  input: "batch_normalization_6/cond/ReadVariableOp_1"
  input: "batch_normalization_6/cond/Const"
  input: "batch_normalization_6/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_6/Conv2D"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_6/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_6/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_6/gamma"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_6/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_6/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_6/beta"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_6/moving_mean"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_6/moving_variance"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_6/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_6/cond/ReadVariableOp_2"
  input: "batch_normalization_6/cond/ReadVariableOp_3"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_6/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_6/Conv2D"
  input: "batch_normalization_6/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_6/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_6/cond/Merge"
  op: "Merge"
  input: "batch_normalization_6/cond/FusedBatchNormV3_1"
  input: "batch_normalization_6/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_6/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_6/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "add_1/add"
  op: "AddV2"
  input: "leaky_re_lu_4/LeakyRelu"
  input: "leaky_re_lu_6/LeakyRelu"
}
node {
  name: "conv2d_7/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_7/kernel"
}
node {
  name: "conv2d_7/Conv2D"
  op: "Conv2D"
  input: "add_1/add"
  input: "conv2d_7/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_7/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_7/cond/Switch:1"
}
node {
  name: "batch_normalization_7/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_7/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_7/gamma"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_7/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_7/beta"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_7/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_7/cond/ReadVariableOp"
  input: "batch_normalization_7/cond/ReadVariableOp_1"
  input: "batch_normalization_7/cond/Const"
  input: "batch_normalization_7/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_7/Conv2D"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_7/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_7/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_7/gamma"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_7/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_7/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_7/beta"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_7/moving_mean"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_7/moving_variance"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_7/moving_variance"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1/Switch"
  input: "batch_normalization_7/cond/ReadVariableOp_2"
  input: "batch_normalization_7/cond/ReadVariableOp_3"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_7/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "conv2d_7/Conv2D"
  input: "batch_normalization_7/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_7/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_7/cond/Merge"
  op: "Merge"
  input: "batch_normalization_7/cond/FusedBatchNormV3_1"
  input: "batch_normalization_7/cond/FusedBatchNormV3"
}
node {
  name: "leaky_re_lu_7/LeakyRelu"
  op: "LeakyRelu"
  input: "batch_normalization_7/cond/Merge"
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "conv2d_8/Conv2D/ReadVariableOp"
  op: "Identity"
  input: "conv2d_8/kernel"
}
node {
  name: "conv2d_8/Conv2D"
  op: "Conv2D"
  input: "leaky_re_lu_7/LeakyRelu"
  input: "conv2d_8/Conv2D/ReadVariableOp"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_8/cond/switch_t"
  op: "Identity"
  input: "batch_normalization_8/cond/Switch:1"
}
node {
  name: "batch_normalization_8/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_8/cond/ReadVariableOp/Switch:1"
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_8/gamma"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_8/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_8/cond/ReadVariableOp_1/Switch:1"
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "batch_normalization_8/beta"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_8/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "batch_normalization_8/cond/FusedBatchNormV3/Switch:1"
  input: "batch_normalization_8/cond/ReadVariableOp"
  input: "batch_normalization_8/cond/ReadVariableOp_1"
  input: "batch_normalization_8/cond/Const"
  input: "batch_normalization_8/cond/Const_1"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0005000000237487257
    }
  }
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "conv2d_8/Conv2D"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv2d_8/Conv2D"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_2"
  op: "Identity"
  input: "batch_normalization_8/cond/ReadVariableOp_2/Switch"
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "batch_normalization_8/gamma"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_8/gamma"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_3"
  op: "Identity"
  input: "batch_normalization_8/cond/ReadVariableOp_3/Switch"
}
node {
  name: "batch_normalization_8/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "batch_normalization_8/beta"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_8/beta"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "Identity"
  input: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "batch_normalization_8/moving_mean"
  input: "batch_normalization_8/cond/pred_id"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@batch_normalization_8/moving_mean"
      }
    }
  }
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "Identity"
  input: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
}
node {
  name: "batch_normalization_8/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
